#ifndef STRUCT_HPP
#define STRUCT_HPP


#include <map>

namespace velalg {

	enum languages {russian, english};
	enum genders { MASCUL, FEM };
	enum power_grades { once=0, thous, mill, bill, trill, quad, quint };

	typedef std::vector< std::vector <std::string> > D2String;
	typedef std::map <genders, D2String>  UnitNumeralList;

	struct PowerNumeralStruct{
		genders grade_gender;
		std::vector<std::string> names;
	};
	typedef std::vector<PowerNumeralStruct> PowerNumeralList;


	//std::string a_power[][3]={ 
  //{""          ,""           ,""            },  // 1
  //{"тысяча "     ,"тысячи "      ,"тысяч "        },  // 2
  //{"миллион "    ,"миллиона "    ,"миллионов "    },  // 3
  //{"миллиард "   ,"миллиарда "   ,"миллиардов "   },  // 4
  //{"триллион "   ,"триллиона "   ,"триллионов "   },  // 5
  //{"квадриллион ","квадриллиона ","квадриллионов "},  // 6
  //{"квинтиллион ","квинтиллиона ","квинтиллионов "}   // 7
//};


	//std::string mascul_unit[][4]={ 
  //{""       ,"десять "      ,""            ,""          },
  //{"одна "  ,"одиннадцать " ,"десять "     ,"сто "      },
  //{"две "   ,"двенадцать "  ,"двадцать "   ,"двести "   },
  //{"три "   ,"тринадцать "  ,"тридцать "   ,"триста "   },
  //{"четыре ","четырнадцать ","сорок "      ,"четыреста "},
  //{"пять "  ,"пятнадцать "  ,"пятьдесят "  ,"пятьсот "  },
  //{"шесть " ,"шестнадцать " ,"шестьдесят " ,"шестьсот " },
  //{"семь "  ,"семнадцать "  ,"семьдесят "  ,"семьсот "  },
  //{"восемь ","восемнадцать ","восемьдесят ","восемьсот "},
  //{"девять ","девятнадцать ","девяносто "  ,"девятьсот "}
//};


	//std::string fem_unit[][4]={ 
  //{""       ,"десять "      ,""            ,""          },
  //{"одна "  ,"одиннадцать " ,"десять "     ,"сто "      },
  //{"две "   ,"двенадцать "  ,"двадцать "   ,"двести "   },
  //{"три "   ,"тринадцать "  ,"тридцать "   ,"триста "   },
  //{"четыре ","четырнадцать ","сорок "      ,"четыреста "},
  //{"пять "  ,"пятнадцать "  ,"пятьдесят "  ,"пятьсот "  },
  //{"шесть " ,"шестнадцать " ,"шестьдесят " ,"шестьсот " },
  //{"семь "  ,"семнадцать "  ,"семьдесят "  ,"семьсот "  },
  //{"восемь ","восемнадцать ","восемьдесят ","восемьсот "},
  //{"девять ","девятнадцать ","девяносто "  ,"девятьсот "}

//};



}

#endif//STRUCT_HPP
