#ifndef STRUCT_HPP
#define STRUCT_HPP



namespace velalg {

	enum languages {russian, english};
	enum genders { mascul, fem };
	enum power_grades { once=0, thous, mill, bill, trill, quad, quint };

	typedef std::vector< std::vector <std::string> > d2_string;
	typedef std::map <genders, d2_string>  units;

	struct power{
		std::vector<genders> grade_gender;
		d2_string names;
	};


	std::string a_power[][3]={ 
  {""          ,""           ,""            },  // 1
  {"тысяча "     ,"тысячи "      ,"тысяч "        },  // 2
  {"миллион "    ,"миллиона "    ,"миллионов "    },  // 3
  {"миллиард "   ,"миллиарда "   ,"миллиардов "   },  // 4
  {"триллион "   ,"триллиона "   ,"триллионов "   },  // 5
  {"квадриллион ","квадриллиона ","квадриллионов "},  // 6
  {"квинтиллион ","квинтиллиона ","квинтиллионов "}   // 7
};


	std::string mascul_unit[][4]={ 
  {""       ,"десять "      ,""            ,""          },
  {"одна "  ,"одиннадцать " ,"десять "     ,"сто "      },
  {"две "   ,"двенадцать "  ,"двадцать "   ,"двести "   },
  {"три "   ,"тринадцать "  ,"тридцать "   ,"триста "   },
  {"четыре ","четырнадцать ","сорок "      ,"четыреста "},
  {"пять "  ,"пятнадцать "  ,"пятьдесят "  ,"пятьсот "  },
  {"шесть " ,"шестнадцать " ,"шестьдесят " ,"шестьсот " },
  {"семь "  ,"семнадцать "  ,"семьдесят "  ,"семьсот "  },
  {"восемь ","восемнадцать ","восемьдесят ","восемьсот "},
  {"девять ","девятнадцать ","девяносто "  ,"девятьсот "}
};


	std::string fem_unit[][4]={ 
  {""       ,"десять "      ,""            ,""          },
  {"одна "  ,"одиннадцать " ,"десять "     ,"сто "      },
  {"две "   ,"двенадцать "  ,"двадцать "   ,"двести "   },
  {"три "   ,"тринадцать "  ,"тридцать "   ,"триста "   },
  {"четыре ","четырнадцать ","сорок "      ,"четыреста "},
  {"пять "  ,"пятнадцать "  ,"пятьдесят "  ,"пятьсот "  },
  {"шесть " ,"шестнадцать " ,"шестьдесят " ,"шестьсот " },
  {"семь "  ,"семнадцать "  ,"семьдесят "  ,"семьсот "  },
  {"восемь ","восемнадцать ","восемьдесят ","восемьсот "},
  {"девять ","девятнадцать ","девяносто "  ,"девятьсот "}

};



}

#endif//STRUCT_HPP
